; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v2 ?v10)
             (pred_5 ?v1 ?v13)
             (pred_4 ?v2 ?v13)
             (pred_12 ?v5 ?v2 )
	     (pred_2 ?v2)
             (pred_10 ?v7)
             (pred_7 ?v1)
             (pred_8 ?v13)
             (pred_11 ?v2)
             (pred_9 ?v1)
             (pred_3 ?v2)
             (pred_6 ))



(:action op_5
:parameters (?v8 ?v12 ?v3 ?v6)
:precondition (and (pred_10 ?v8) (pred_10 ?v12) (pred_7 ?v3) (pred_8 ?v6)
          (pred_1 ?v8 ?v12) (pred_5 ?v3 ?v6)
                   (pred_4 ?v12 ?v6) (pred_2 ?v8) 
                   (pred_11 ?v12) (pred_9 ?v3))
:effect (and  (pred_3 ?v12) (not (pred_11 ?v12))))


(:action op_1
:parameters (?v8 ?v11)
:precondition (and (pred_10 ?v8) (pred_10 ?v11)
               (pred_2 ?v8) (pred_1 ?v8 ?v11) (pred_3 ?v11))
:effect (and (pred_2 ?v11) (not (pred_2 ?v8))))

(:action op_3
:parameters (?v8 ?v3)
:precondition (and (pred_10 ?v8) (pred_7 ?v3) 
                  (pred_2 ?v8) (pred_12 ?v3 ?v8) (pred_6 ))
:effect (and (pred_9 ?v3)
   (not (pred_12 ?v3 ?v8)) (not (pred_6 ))))


(:action op_2
:parameters (?v8 ?v9 ?v4)
:precondition (and (pred_10 ?v8) (pred_7 ?v9) (pred_7 ?v4)
                  (pred_2 ?v8) (pred_9 ?v4) (pred_12 ?v9 ?v8))
:effect (and (pred_9 ?v9) (pred_12 ?v4 ?v8)
        (not (pred_9 ?v4)) (not (pred_12 ?v9 ?v8))))

(:action op_4
:parameters (?v8 ?v3)
:precondition (and (pred_10 ?v8) (pred_7 ?v3) 
                  (pred_2 ?v8) (pred_9 ?v3))
:effect (and (pred_6 ) (pred_12 ?v3 ?v8) (not (pred_9 ?v3)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_20 obj_08 obj_18 obj_04 obj_09 obj_10 obj_01 obj_16 obj_11 obj_14 obj_03 obj_07 obj_17 obj_12 obj_02 obj_19
    obj_15 obj_05
    obj_13 obj_06
    )

    (:init
       (pred_6)

       (pred_10 obj_20)
       (pred_10 obj_08)
       (pred_10 obj_18)
       (pred_10 obj_04)
       (pred_10 obj_09)
       (pred_10 obj_10)
       (pred_10 obj_01)
       (pred_10 obj_16)
       (pred_10 obj_11)
       (pred_10 obj_14)
       (pred_10 obj_03)
       (pred_10 obj_07)
       (pred_10 obj_17)
       (pred_10 obj_12)
       (pred_10 obj_02)
       (pred_10 obj_19)
       (pred_8 obj_15)
       (pred_8 obj_05)
       (pred_7 obj_13)
       (pred_7 obj_06)

       (pred_1 obj_20 obj_09)
       (pred_1 obj_20 obj_08)
       (pred_1 obj_08 obj_10)
       (pred_1 obj_08 obj_18)
       (pred_1 obj_08 obj_20)
       (pred_1 obj_18 obj_01)
       (pred_1 obj_18 obj_04)
       (pred_1 obj_18 obj_08)
       (pred_1 obj_04 obj_16)
       (pred_1 obj_04 obj_18)
       (pred_1 obj_09 obj_11)
       (pred_1 obj_09 obj_10)
       (pred_1 obj_09 obj_20)
       (pred_1 obj_10 obj_14)
       (pred_1 obj_10 obj_01)
       (pred_1 obj_10 obj_08)
       (pred_1 obj_10 obj_09)
       (pred_1 obj_01 obj_03)
       (pred_1 obj_01 obj_16)
       (pred_1 obj_01 obj_18)
       (pred_1 obj_01 obj_10)
       (pred_1 obj_16 obj_07)
       (pred_1 obj_16 obj_04)
       (pred_1 obj_16 obj_01)
       (pred_1 obj_11 obj_17)
       (pred_1 obj_11 obj_14)
       (pred_1 obj_11 obj_09)
       (pred_1 obj_14 obj_12)
       (pred_1 obj_14 obj_03)
       (pred_1 obj_14 obj_10)
       (pred_1 obj_14 obj_11)
       (pred_1 obj_03 obj_02)
       (pred_1 obj_03 obj_07)
       (pred_1 obj_03 obj_01)
       (pred_1 obj_03 obj_14)
       (pred_1 obj_07 obj_19)
       (pred_1 obj_07 obj_16)
       (pred_1 obj_07 obj_03)
       (pred_1 obj_17 obj_12)
       (pred_1 obj_17 obj_11)
       (pred_1 obj_12 obj_02)
       (pred_1 obj_12 obj_14)
       (pred_1 obj_12 obj_17)
       (pred_1 obj_02 obj_19)
       (pred_1 obj_02 obj_03)
       (pred_1 obj_02 obj_12)
       (pred_1 obj_19 obj_07)
       (pred_1 obj_19 obj_02)
       (pred_11 obj_18)
       (pred_11 obj_01)
       (pred_4  obj_18 obj_15)
       (pred_4  obj_01 obj_05)
       (pred_3 obj_20)
       (pred_3 obj_08)
       (pred_3 obj_04)
       (pred_3 obj_09)
       (pred_3 obj_10)
       (pred_3 obj_16)
       (pred_3 obj_11)
       (pred_3 obj_14)
       (pred_3 obj_03)
       (pred_3 obj_07)
       (pred_3 obj_17)
       (pred_3 obj_12)
       (pred_3 obj_02)
       (pred_3 obj_19)

       (pred_5  obj_13 obj_15)
       (pred_5  obj_06 obj_05)
       (pred_12 obj_13 obj_08)
       (pred_12 obj_06 obj_07)
       (pred_2 obj_02)
    )

    (:goal (and
       (pred_12 obj_13 obj_16)
    ))
(:constraints
  (always (not (pred_2 obj_18)))
)
)

; plan
1. (op_1 obj_02 obj_12)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_12)
   goals met: 0 of 1
2. (op_1 obj_12 obj_14)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_14)
   goals met: 0 of 1
3. (op_1 obj_14 obj_10)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_10)
   goals met: 0 of 1
4. (op_1 obj_10 obj_08)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_08)
   goals met: 0 of 1
5. (op_3 obj_08 obj_13)
   deleted: (pred_12 obj_13 obj_08) (pred_6)
   added: (pred_9 obj_13)
   goals met: 0 of 1
6. (op_1 obj_08 obj_10)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_10)
   goals met: 0 of 1
7. (op_1 obj_10 obj_14)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_14)
   goals met: 0 of 1
8. (op_1 obj_14 obj_03)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_03)
   goals met: 0 of 1
9. (op_1 obj_03 obj_07)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_07)
   goals met: 0 of 1
10. (op_1 obj_07 obj_16)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_16)
   goals met: 0 of 1
11. (op_4 obj_16 obj_13)
   deleted: (pred_9 obj_13)
   added: (pred_6) (pred_12 obj_13 obj_16)
   goals met: 1 of 1
